//题目：如果两间相邻的房屋在同一晚上被小偷闯入，系统会自动报警。
//给定一个代表每个房屋存放金额的非负整数数组，计算你在不触动警报装置的情况下，能够偷窃到的最高金额。
//例：输入: [1,2,3,1]
//   输出: 4

//这是第一次的提交记录
//执行用时108ms，超过89.47%的C#提交记录=v=（明明跟能看到的最快用例是一样的代码。。）
//看了一下最快用例的代码，觉得非常精妙，所以提交了一下做个记录
//没有用备忘录记录所有值，而是采用了一个值记录上一次得到的值
//（因为公式本身只用对比计算f(k-2)和f(k-1)，所以这个代码省了很多内存

public class Solution 
{
    public int Rob(int[] nums) 
    {
        int cur = 0;
        int pre = 0;
        for(int i=0;i<nums.Length;i++)
        {
            int tmp = cur;
            cur = Math.Max(nums[i] + pre, cur);
            pre = tmp;
        }
        return cur;
    }
}