//题目：给定一个二进制矩阵 A，我们想先水平翻转图像，然后反转图像并返回结果。
//水平翻转图片就是将图片的每一行都进行翻转，即逆序。例如，水平翻转 [1, 1, 0] 的结果是 [0, 1, 1]。
//反转图片的意思是图片中的 0 全部被 1 替换， 1 全部被 0 替换。例如，反转 [0, 1, 1] 的结果是 [1, 0, 0]
//例：输入: [[1,1,0],[1,0,1],[0,0,0]]
//   输出: [[1,0,0],[0,1,0],[1,1,1]]

//这是第N次的提交记录
//执行用时288ms，超过93.85%的C#提交记录=v=
//思路是遍历数组，在翻转的同时反转当前元素
//ps.反转思路是用的大佬的，也可以跟1取异或


public class Solution 
{
    public int[][] FlipAndInvertImage(int[][] A)
    {
        int c = A[0].Length - 1;
        foreach (int[] i in A)
            for (int j = 0; j < (c + 2) / 2; j++)
            {
                int temp = 1 - i[j];
                i[j] = 1 - i[c - j];
                i[c - j] = temp;
            }
        return A;
    }
}